<template>
  <div>
    <div style="margin:20px">
      <p>&nbsp;&nbsp;在地理科学的研究中，地理模型是地理现象、地理过程和地理规律的主要表现形式（Goodchild et al.,1996）。基于涉及多领域知识的多种地理模型应用，包括模拟、预测、分析和验证等，是在涉及地质、大气、海洋、水文和人文等多学科背景下求解复杂地球系统科学问题如环境污染防治、潮汐动力分析、生态影响评估等的重要方法之一（邬伦，1994；Lin et al.,2015）。如在大气领域，利用WRF-Chem(Weather Research and Forecasting model coupled with Chemistry)模型进行污染物预测，解决夜间条件和复杂地形下城市PM10和PM2.5污染事件防治问题（Saide et al., 2011）。如在海洋领域，利用FVCOM(the unstructured grid Finite Volume Community Ocean Model)模型进行海洋潮汐驱动过程模拟，解决对潮汐驱动过程下能量的收支估计问题（Chen et al.,2011）。如在水文领域，利用SWAT (Soil and Water Assessment Tool)模型进行生态评估，解决东非流域土地利用对水资源的影响评估问题（Douglas-Mankin et al.,2010）。如在人文领域，利用MOVES(The motor vehicle emission simulator)模型进行机动车排放模拟，解决对社会活动中机动车排放物成分浓度的计算问题（Liu,X,2015）。总而言之，诸如上述的多领域地理模型能够有力地解决各种复杂地理问题。而随着信息化背景下分布式计算与网络技术的发展，基于分布式网络来解决地理问题是一种高效且被广泛认可的方式（王宇翔，2002；钱贞国，2004）。进一步，在分布式网络环境下，借助Web服务技术和面向服务的软件架构策略SOA（Service-Oriented Architecture），以网络服务化封装的形式，调用和共享地理模型服务是目前地理模型服务分布式应用的主要方式（温永宁等，2006；胡迪，2012）。
基于地理模型服务分布式应用来解决地理问题，主要的应用环节有问题分析、服务调用和结果分析三个基本步骤（游伟东，2017；杨慧等，2019）。以两个应用案例进行进一步阐述：首先，如利用开发的Web-SWMM网页系统，在线调用基于OpenGMS平台封装的分布式网络环境下的SWMM(the Storm Water Management Model)模型服务，应用于中国苏州市美颂花园小区的雨洪模拟研究（Xiao et al.,2019）。实际上，该研究首先进行问题分析，即如何评估暴雨情景下研究区中雨水井和地下管网的排洪防涝能力，针对问题组织和准备网络环境中分散化存储的、涉及多领域知识的原始数据（包括基础地形数据、城市建设领域的排水系统数据、水文领域内的字汇水区参数数据等）。然后调用分布式网络环境下的SWMM模型服务进行模拟应用，在服务调用前先预处理原始数据得到的INP数据作为模型服务输入。最后依据模拟结果进行分析讨论和结论总结，对结果数据进行可视化表达。其次，如基于开发web原型系统，调用配置在分布式网络网络中针对中国中南部杉木部署的森林生长模型服务，应用于森林生长模拟（Ma et al.,2019）。该研究首先分析问题，即如何通过模型模拟预测森林在若干年后的生长状况，组织和准备分散存储在网络中的多领域数据（包括林业领域树龄和树高数据、气象领域温度和降水数据等）。然后调用相应森林生长集成模型分布式服务，在调用模型服务前还为服务配置多领域的数据资源，即将输入数据（如林业领域的树木属性数据、基础地形数据DEM等）和涉及多领域知识的模型参数数据(如林分密度、温度、降水和温度参数)提供给模型服务。最后依据服务调用对森林生长的模拟结果进行分析，并对模拟结果数据进行包括图表等形式的可视化表达。总而言之，从上述地理模型服务的多环节应用可以看出：模型服务分布式应用与涉及多学科、分散化存储的数据资源紧密相关。进一步而言，涉及多学科知识背景、网络中分散化存储的数据资源不能简单闭锁在单一领域内，而应该在分布式网络环境中被共享出来，支持数据资源服务化的发布和调用，以使多领域专家可以结合交叉学科知识协作式地应用多模型分布式服务到复杂地理问题的求解中（宋梦蝶等，2017）。因此，网络环境下多学科、分散化存储的数据资源服务化共享是支持地理模型分布式应用的重要基础。
目前的数据服务共享在核心策略层次上主要有基于元数据共享、数据标准化、数据镜像、共享平台、云存储等理念的数据服务化共享方法（李晓波，2007；宋梦蝶等，2017）。在满足模型应用数据需求方面，上述方法在数据描述、处理和表达等方面难以满足需求。如元数据共享策略，尽管可以从跨学科数据库中访问多种数据资源，但缺少数据表达，不能满足地理模型数据表达的需求(黄岩，2013)。数据标准化策略，如开放地理空间信息联盟OGC（Open Geospatial Consortium）提出的标准(Reed et al.,2011)。由于地理模型数据在结构、数据量和信息内涵等方面十分多样，所以难以仅凭借一种标准化方式对多源异构的地理模型数据全部实现标准化。数据镜像策略，是对整体数据集在不同物理站点进行完全一致的复制，没有元数据描述，不能满足应用时通过认识模型数据元数据描述来判断数据是否对模型可用的需求（李晓波，2007）。共享平台和云存储策略，只是单纯获取数据，不能满足在模型服务集成应用中的可能涉及数据转换处理的数据交换和按需获取数据的需求（诸云强，2010；贺啸梅，2020）。总而言之，这些已有共享方法不适用于满足地理模型服务的分布式应用数据需求，在在满足地理模型服务应用在数据描述需求方面表现不足，同时欠缺地理模型数据在文件、内容和表达多方面，对模型应用的数据服务支持。难以为地理模型的分布式应用提供更加便捷的数据服务支撑。
</p>
    </div>

  </div>
</template>

<script>
  export default {
    data: () => ({
      
    }),
     
  }
</script>

<style>

</style>
